In [1]:
import pandas as pd
import os

In [2]:
df_22 = pd.read_excel('2022 Ercot.xlsx')
df_22.head(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,01/01/2022 01:00,12054.939199,1302.296674,4161.193625,757.843076,9676.300802,3172.878316,5908.031505,973.455700,38006.938896
1,01/01/2022 02:00,11793.290315,1259.355201,4147.907009,737.236591,9307.126712,3123.318608,5708.512022,959.775908,37036.522365
2,01/01/2022 03:00,11460.841252,1210.287905,4156.412366,725.610502,8920.424552,3003.396233,5463.522829,941.112359,35881.607998

In [32]:
df_22.shape

(4343, 10)

In [3]:
df_21 = pd.read_excel('2021 Ercot.xlsx')
df_21.head(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,01/01/2021 01:00,11047.018793,1517.435253,3978.220628,838.352810,13575.277728,3545.093310,7778.262533,1440.188560,43719.849616
1,01/01/2021 02:00,10954.470339,1523.683893,3975.757045,825.123437,13340.337915,3586.547882,7693.744119,1421.385715,43321.050347
2,01/01/2021 03:00,10883.657240,1519.800916,3969.812081,819.551228,13311.625189,3586.124059,7566.951524,1405.544826,43063.067063

In [33]:
df_21.shape

(8760, 10)

In [4]:
df_20 = pd.read_excel('2020 Ercot.xlsx')
df_20.head(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,01/01/2020 01:00,9890.091522,1364.278198,3721.972022,773.878822,11719.863767,2707.841517,5473.246071,1172.943179,36824.115099
1,01/01/2020 02:00,9751.586415,1369.569694,3735.514034,775.063743,11639.455987,2706.844837,5387.380467,1165.951313,36531.366488
2,01/01/2020 03:00,9603.421087,1373.528720,3735.851866,774.153775,11515.421981,2650.378864,5270.331958,1149.076769,36072.165020

In [34]:
df_20.shape

(8784, 10)

In [6]:
df_19 = pd.read_excel('2019 Ercot.xlsx')
df_19.head(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,01/01/2019 01:00,9783.594839,1264.194059,3164.720629,827.759428,11697.766093,3066.891146,5993.974289,1282.542956,37081.443439
1,01/01/2019 02:00,9726.062326,1270.494294,3178.950849,830.256302,11787.936174,3140.383209,6029.773970,1295.132811,37258.989933
2,01/01/2019 03:00,9654.373521,1269.504203,3200.881160,831.505553,11861.628382,3137.721342,6043.348512,1301.225133,37300.187809

In [35]:
df_19.shape

(8760, 10)

In [7]:
df_18 = pd.read_excel('2018 Ercot.xlsx')
df_18.head(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,01/01/2018 01:00,11425.979115,1852.663959,2823.409245,1135.360907,18584.343617,3831.649454,9151.190703,1762.472684,50567.069682
1,01/01/2018 02:00,11408.418023,1850.169452,2809.745403,1136.630855,18524.141392,3988.271046,9144.993712,1754.718094,50617.087977
2,01/01/2018 03:00,11405.198365,1858.269586,2797.802576,1135.930264,18532.056616,4076.086451,9141.036615,1747.919615,50694.300087

In [36]:
df_18.shape

(8760, 10)

In [8]:
df_17 = pd.read_excel('2017 Ercot.xlsx')
df_17.head(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,01/01/2017 01:00,8791.789509,896.746302,1997.717635,683.621986,9239.153285,2366.632745,4490.781365,954.192864,29420.635691
1,01/01/2017 02:00,8569.708419,865.930568,1997.781319,677.969375,9104.997245,2332.744630,4370.656830,951.025166,28870.813551
2,01/01/2017 03:00,8326.425638,839.051175,1993.699160,671.998949,8988.035201,2237.506202,4210.650003,944.357749,28211.724078

In [37]:
df_17.shape

(8760, 10)

In [9]:
df_16 = pd.read_excel('2016 Ercot.xlsx')
df_16.head(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,2016-01-01 01:00:00.003,9001.477932,1148.358788,2107.895986,788.543919,11409.339036,2829.993195,5479.057816,1088.091916,33852.758587
1,2016-01-01 01:59:59.997,8864.555456,1134.909662,2100.702470,782.355108,11235.174936,2830.075196,5405.955778,1080.369336,33434.097940
2,2016-01-01 03:00:00.000,8745.758728,1126.864026,2099.966167,781.237004,11151.965219,2789.470654,5334.159606,1069.644619,33099.066023

In [38]:
df_16.shape

(8784, 10)

In [10]:
df_15 = pd.read_excel('2015 Ercot.xls')
df_15.head(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,2015-01-01 01:00:00.003,9844.200268,1350.784678,2078.060021,901.770195,13640.024978,3607.904503,6731.301663,1470.814721,39624.861027
1,2015-01-01 01:59:59.997,9653.456269,1333.434943,2057.993265,890.150373,13425.121941,3609.619438,6602.935629,1440.832944,39013.544802
2,2015-01-01 03:00:00.000,9502.299659,1323.908498,2039.019542,880.926639,13286.070909,3573.158363,6530.663273,1430.495044,38566.541927

In [39]:
df_15.shape

(8760, 10)

In [11]:
df_14 = pd.read_excel('2014 Ercot.xls')
df_14.head(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,2014-01-01 01:00:00.003,9101.691219,1338.197939,1820.206244,793.458458,12298.801147,3236.109065,6121.146143,1102.523505,35812.133719
1,2014-01-01 01:59:59.997,8907.975782,1328.940064,1809.180861,791.141630,12297.109823,3246.493375,6091.018850,1098.774771,35570.635156
2,2014-01-01 03:00:00.000,8738.460973,1317.990846,1804.524573,789.791906,12285.295247,3217.721388,6060.017515,1097.716762,35311.519210

In [40]:
df_14.shape

(8760, 10)

In [12]:
df_13 = pd.read_excel('2013 Ercot.xls')
df_13.head(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,2013-01-01 01:00:00.003,7607.189871,1074.024285,1411.823159,763.069242,10370.322921,2206.945802,4368.528687,883.029500,28684.933467
1,2013-01-01 01:59:59.997,7389.267519,1035.189180,1403.601093,754.425986,10153.942806,2160.082197,4233.635250,872.532258,28002.676290
2,2013-01-01 03:00:00.000,7179.748411,1036.216739,1395.131213,746.215515,9989.243532,2065.369913,4082.897707,868.951334,27363.774363

In [41]:
df_13.shape

(8760, 10)

In [13]:
df_12 = pd.read_excel('2012 Ercot.xls')
df_12.head(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,2012-01-01 01:00:00.003,7748.160500,878.438488,1289.746813,652.153054,8648.989316,2105.379142,4162.162310,849.000892,26334.030515
1,2012-01-01 01:59:59.997,7559.728089,839.092904,1294.272245,643.483530,8553.212708,2047.755534,4070.416593,845.097363,25853.058967
2,2012-01-01 03:00:00.000,7337.789042,817.995707,1296.491345,631.940923,8461.317967,1961.909818,3946.994332,840.902848,25295.341984

In [42]:
df_12.shape

(8784, 10)

In [14]:
df_11 = pd.read_excel('2011 Ercot.xls')
df_11.head(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,2011-01-01 01:00:00.003,7242.844978,919.318501,1273.185354,762.181838,10038.701857,2033.434272,4448.833193,943.943487,27662.443480
1,2011-01-01 01:59:59.997,7028.298944,906.680146,1273.258677,762.644083,9982.845460,1964.750313,4401.280885,930.286207,27250.044715
2,2011-01-01 03:00:00.000,6870.407297,877.968337,1272.137325,763.843552,9870.152864,1885.766434,4320.909860,922.040412,26783.226081

In [43]:
df_11.shape

(8760, 10)

In [15]:
df_10 = pd.read_excel('2010 Ercot.xls')
df_10.head(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,2010-01-01 01:00:00.003,7775.456846,1238.179861,1237.649967,877.672404,12405.849409,2467.581039,5031.931981,1059.742927,32094.064435
1,2010-01-01 01:59:59.997,7704.815982,1236.050964,1248.907364,883.621724,12485.814858,2436.025369,5111.468920,1064.617365,32171.322546
2,2010-01-01 03:00:00.000,7650.575724,1244.073140,1251.207485,881.155327,12559.461123,2414.440222,5168.887617,1071.951825,32241.752463

In [45]:
df_10.shape

(8760, 10)

In [16]:
df_9 = pd.read_excel('2009 Ercot.xls')
df_9.head(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,2009-01-01 01:00:00.003,7300.317873,1173.516507,1221.195150,809.370368,10329.687507,1841.693608,4601.280319,902.794867,28179.856199
1,2009-01-01 01:59:59.997,7174.769899,1161.605492,1221.723993,801.758344,10284.115785,1769.591445,4533.730682,903.455645,27850.751284
2,2009-01-01 03:00:00.000,7108.488956,1162.793073,1221.679497,796.833243,10238.594551,1722.553266,4452.980186,901.649905,27605.572678

In [46]:
df_9.shape

(8760, 10)

In [17]:
df_8 = pd.read_excel('2008 Ercot.xls')
df_8.head(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,2008-01-01 01:00:00.003,7582.426275,1137.197278,1289.741591,1120.591245,10782.487804,1894.920943,4857.044340,932.251506,29596.660982
1,2008-01-01 01:59:59.997,7483.387277,1129.312429,1320.549720,1130.163920,10873.001190,1826.089194,4867.512567,939.958255,29569.974551
2,2008-01-01 03:00:00.000,7381.744778,1155.484647,1328.442079,1129.355056,10952.637481,1832.883827,4849.639885,951.322118,29581.509870

In [47]:
df_8.shape

(8784, 10)

In [18]:
df_7 = pd.read_excel('2007 Ercot.xls')
df_7.head(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,2007-01-01 01:00:00.003,7883.987618,1157.996001,1192.611809,1049.767230,10278.440568,1933.973511,4872.454048,870.272863,29239.503647
1,2007-01-01 01:59:59.997,7681.614678,1153.342085,1202.375412,1042.690867,10254.628659,1907.297022,4908.541918,879.240371,29029.731012
2,2007-01-01 03:00:00.000,7549.359777,1166.882378,1214.996069,1041.928347,10282.656844,1883.466870,4925.082296,891.610454,28955.983035

In [48]:
df_7.shape

(8760, 10)

In [19]:
df_6 = pd.read_excel('2006 Ercot.xls')
df_6.head(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,2006-01-01 01:00:00.003,7623.394894,788.305875,1026.559049,777.157535,7549.809438,1852.416802,3797.223989,639.553370,24054.420954
1,2006-01-01 01:59:59.997,7437.102525,779.587442,1024.320168,752.171350,7291.494704,1770.283786,3637.505535,628.083900,23320.549410
2,2006-01-01 03:00:00.000,7151.481479,767.310985,1011.297406,725.028737,7012.269706,1676.891230,3482.207530,614.014931,22440.502004

In [49]:
df_6.shape

(8760, 10)

In [20]:
df_5 = pd.read_excel('2005 Ercot.xls')
df_5.head(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,2005-01-01 01:00:00.003,7507.810731,850.313988,998.465500,741.963778,7312.259820,1883.979457,3728.400885,692.294503,23715.488663
1,2005-01-01 01:59:59.997,7257.549136,818.143264,987.532852,711.996586,7012.466197,1798.234153,3562.614723,675.176013,22823.712923
2,2005-01-01 03:00:00.000,6973.987199,783.396624,978.575662,687.881144,6712.807281,1712.758395,3373.868049,659.650453,21882.924807

In [50]:
df_5.shape

(8760, 10)

In [21]:
df_4 = pd.read_excel('2004 Ercot.xls')
df_4.head(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,2004-01-01 01:00:00.003,7225.087742,877.786281,1044.891487,745.789652,7124.208773,1660.451157,3639.115900,654.610079,22971.941071
1,2004-01-01 01:59:59.997,6994.247187,850.745765,1032.040567,721.344360,6854.581504,1603.520440,3495.158058,639.879137,22191.517017
2,2004-01-01 03:00:00.000,6717.415522,831.633221,1021.098479,699.704826,6639.484787,1527.985961,3322.697830,623.416884,21383.437510

In [51]:
df_4.shape

(8784, 10)

In [22]:
df_3 = pd.read_excel('2003 Ercot.xls')
df_3.head(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,2003-01-01 01:00:00.003,7314.780744,1036.148174,1045.133783,923.252130,8894.325899,1789.728088,4126.710428,720.614612,25850.693856
1,2003-01-01 01:59:59.997,7191.622771,1052.905958,1057.384009,925.322632,8903.379971,1743.996713,4122.863299,717.870496,25715.345849
2,2003-01-01 03:00:00.000,7070.109415,1054.472158,1066.026565,930.799970,8956.825659,1705.079075,4096.731053,714.620617,25594.664511

In [52]:
df_3.shape

(8760, 10)

In [27]:
total_df = pd.concat([df_22, df_21, df_20, df_19, df_18, df_17, df_16, df_15, df_14, df_13, df_12, df_11, df_10, df_9, df_8, df_7, df_6, df_5, df_4, df_3])

In [29]:
total_df.head()

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,01/01/2022 01:00,12054.939199,1302.296674,4161.193625,757.843076,9676.300802,3172.878316,5908.031505,973.455700,38006.938896
1,01/01/2022 02:00,11793.290315,1259.355201,4147.907009,737.236591,9307.126712,3123.318608,5708.512022,959.775908,37036.522365
2,01/01/2022 03:00,11460.841252,1210.287905,4156.412366,725.610502,8920.424552,3003.396233,5463.522829,941.112359,35881.607998
3,01/01/2022 04:00,11244.980243,1179.311517,4149.811722,717.420214,8678.807826,2898.097471,5255.252404,920.373708,35044.055105
4,01/01/2022 05:00,11073.085585,1171.841803,4140.619028,719.178247,8573.370608,2825.100402,5164.172158,918.203309,34585.571140

In [28]:
total_df.tail()

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
8755,2003-12-31 19:59:59.997000,8444.958876,1148.217278,1107.466740,983.318268,9471.164783,2138.467029,4751.357921,835.726184,28880.677078
8756,2003-12-31 21:00:00,8214.045287,1086.833166,1081.332278,934.795232,8906.139752,2075.710908,4481.160298,799.292161,27579.309082
8757,2003-12-31 22:00:00.003000,7887.578948,1044.444718,1064.811415,899.195564,8429.654103,1990.168080,4252.723438,769.999435,26338.575701
8758,2003-12-31 22:59:59.997000,7622.361496,996.751206,1048.333350,870.757267,7945.101209,1903.435037,4058.069273,745.194707,25190.003546
8759,2004-01-01 00:00:00,7346.979400,959.863190,1031.215580,828.932820,7502.855700,1820.992400,3829.802820,707.768440,24028.410350

In [30]:
total_df.shape

(170903, 10)

In [55]:
total_df.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
Hour Ending,170903,170889,2009-11-01 01:59:59.997,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
COAST,170902.0,NaN,NaT,NaN,11015.868063,2702.674848,1702.829343,9058.077741,10470.12726,12516.714254,22014.020458
EAST,170902.0,NaN,NaT,NaN,1415.530713,342.858736,737.857378,1176.321216,1343.394648,1600.207252,2949.198517
FWEST,170902.0,NaN,NaT,NaN,2007.148227,1007.376272,845.444632,1219.375503,1587.54351,2481.956553,5385.402496
NORTH,170902.0,NaN,NaT,NaN,933.829876,261.699603,488.272293,740.720064,874.29433,1063.21094,2305.722761
NCENT,170902.0,NaN,NaT,NaN,12555.103233,3507.05823,5852.608525,10121.242526,11742.611962,14345.21243,26499.240955
SOUTH,170902.0,NaN,NaT,NaN,3035.832796,864.932504,1340.984853,2388.076407,2896.199037,3536.91352,6192.252947
SCENT,170902.0,NaN,NaT,NaN,6274.772524,1758.510624,2960.304993,5031.965315,5883.95512,7209.211894,14166.701623
WEST,170902.0,NaN,NaT,NaN,1071.561905,256.74972,525.299257,884.072907,1032.073781,1214.28751,2117.399078
ERCOT,170902.0,NaN,NaT,NaN,38310.007958,9740.50498,19269.758294,31276.225017,36411.566614,43598.22136,76680.594844

In [56]:
total_df['Hour Ending'].value_counts()

2009-11-01 01:59:59.997    2
2007-11-04 01:59:59.997    2
2005-10-30 01:59:59.997    2
2008-11-02 01:59:59.997    2
2012-11-04 01:59:59.997    2
                          ..
2015-01-01 15:00:00.000    1
2015-01-01 16:00:00.003    1
2015-01-01 16:59:59.997    1
2015-01-01 18:00:00.000    1
2004-01-01 00:00:00.000    1
Name: Hour Ending, Length: 170889, dtype: int64

In [57]:
coast_df = total_df.drop(columns = ['EAST', 'FWEST', 'NORTH', 'NCENT', 'SOUTH', 'SCENT', 'WEST'])
coast_df.head()

        Hour Ending         COAST         ERCOT
0  01/01/2022 01:00  12054.939199  38006.938896
1  01/01/2022 02:00  11793.290315  37036.522365
2  01/01/2022 03:00  11460.841252  35881.607998
3  01/01/2022 04:00  11244.980243  35044.055105
4  01/01/2022 05:00  11073.085585  34585.571140

In [58]:
coast_df.shape

(170903, 3)

In [59]:
total_df.to_csv('total_df.csv')

In [60]:
coast_df.to_csv('coast_df.csv')